Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: An implementation may provide built-in functions whose positional parameters do not have names, even if they are 'named' for the purpose of documentation, and which therefore cannot be supplied by keyword. In CPython, this is the case for functions implemented in C that use :cfunc:`PyArg_ParseTuple` to parse their arguments.
ru: В какой-либо реализации могут быть встроенные функции, чьи позиционные параметры не имеют имён (несмотря на то, что в ихней документации для удобства используются некие “имена” ) и, таким образом, эти параметры не могут быть переданы как именованные аргументы. Как пример – функции, реализованные на “C” с использованием «:cfunc:`PyArg_ParseTuple`» для разбора аргументов .

source: If there are more positional arguments than there are formal parameter slots, a :exc:`TypeError` exception is raised, unless a formal parameter using the syntax ``*identifier`` is present; in this case, that formal parameter receives a tuple containing the excess positional arguments (or an empty tuple if there were no excess positional arguments).
ru: Если дано больше аргументов, чем параметров в определении, то вызывается исключение «:exc:`TypeError`» , если только в определении не присутствует параметр с синтаксисом «``*identifier``» – в этом случае этот параметр получает кортеж, содержащий лишние аргументы (или пустой кортеж, если нет таковых) .

source: If any keyword argument does not correspond to a formal parameter name, a :exc:`TypeError` exception is raised, unless a formal parameter using the syntax ``**identifier`` is present; in this case, that formal parameter receives a dictionary containing the excess keyword arguments (using the keywords as keys and the argument values as corresponding values), or a (new) empty dictionary if there were no excess keyword arguments.
ru: Если какой-либо именованный аргумент не соответствует имени параметра в определении, то вызывается исключение «:exc:`TypeError`» , если только в определении не присутствует параметр с синтаксисом «``**identifier``» – в этом случае этот параметр получает словарь (или пустой словарь, если нет лишних), содержащий лишние именованные аргументы, чьи имена становятся ключами – и они получают соответствующие значения.

source: If the syntax ``*expression`` appears in the function call, ``expression`` must evaluate to a sequence. Elements from this sequence are treated as if they were additional positional arguments; if there are positional arguments *x1*,..., *xN*, and ``expression`` evaluates to a sequence *y1*, ..., *yM*, this is equivalent to a call with M+N positional arguments *x1*, ..., *xN*, *y1*, ..., *yM*.
ru: Если в вызове функции встречается синтаксис «``*expression``» , то значением «``expression``» должна быть последовательность. Элементы из этой последовательности извлекаются и воспринимаются как дополнительные позиционные аргументы – тоесть, если в вызове даны позиционные аргументы *x1*,..., *xN* и «``expression``» даёт элементы *y1*, ..., *yM* , то это эквивалентно вызову с *M*+*N* штуками аргументов *x1*, ..., *xN*, *y1*, ..., *yM* .

source: A consequence of this is that although the ``*expression`` syntax may appear *after* some keyword arguments, it is processed *before* the keyword arguments (and the ``**expression`` argument, if any -- see below). So::
ru: Следствием из этого является то, что, хотя «``*expression``» может идти *после* некоторых именованных аргументов, «``*expression``» обрабатывается *раньше* них (и раньше аргумента «``**expression``» ) . Таким образом :

source: It is unusual for both keyword arguments and the ``*expression`` syntax to be used in the same call, so in practice this confusion does not arise.
ru: Использование в вызове одновременно именованных аргументов и синтаксиса «``*expression``» является редким – только поэтому на практике редко возникают и соответствующие недоразумения.

source: If the syntax ``**expression`` appears in the function call, ``expression`` must evaluate to a mapping, the contents of which are treated as additional keyword arguments. In the case of a keyword appearing in both ``expression`` and as an explicit keyword argument, a :exc:`TypeError` exception is raised.
ru: Если в вызове функции встречается синтаксис «``**expression``» , то значением «``expression``» должно быть отображение (словарь) . Элементы из этого отображения извлекаются и воспринимаются как дополнительные именованные аргументы. Если некий ключ (имя) присутствует и в «``expression``» и как явный именованный аргумент, то вызывается исключение «:exc:`TypeError`» .

source: Formal parameters using the syntax ``*identifier`` or ``**identifier`` cannot be used as positional argument slots or as keyword argument names.
ru: Параметры в определении, использующие синтаксис «``*identifier``» или «``**identifier``» , не могут быть использованы как позиционные получатели (как места́) или как имена именованных аргументов.

source: A call always returns some value, possibly ``None``, unless it raises an exception. How this value is computed depends on the type of the callable object.
ru: Вызов всегда возвращает какое-либо значение (в частности «:const:`None`» ) – если только этот вызов не привёл к исключению. То, каким способом это значение вычисляется – зависит от типа вызываемого объекта.

source: The code block for the function is executed, passing it the argument list. The first thing the code block will do is bind the formal parameters to the arguments; this is described in section :ref:`function`. When the code block executes a :keyword:`return` statement, this specifies the return value of the function call.
ru: Функции передаётся список аргументов, и её блок кода исполняется. Первое, что происходит в блоке кода – это связывание имён “формальных” параметров с предоставленными аргументами (подробнее в разделе «Определение функций» :ref:`function` ) . Если в блоке кода исполняется инструкция «:keyword:`return`» , то она задаёт возвращаемое функцией значение – иначе, по-умолчанию, – возвращается «:const:`None`» .

source: The result is up to the interpreter; see :ref:`built-in-funcs` for the descriptions of built-in functions and methods.
ru: Результат зависит от интерпретатора. Смотрите “Встроенные функции” :ref:`built-in-funcs` .

source: A new instance of that class is returned.
ru: Возвращается новый экземпляр этого класса.

source: The corresponding user-defined function is called, with an argument list that is one longer than the argument list of the call: the instance becomes the first argument.
ru: Вызывается соответствующая пользовательская функция, к списку аргументов которой в начале подставляется дополнительный аргумент – соответствующий экземпляр (у которого вызывается метод) .

source: The class must define a :meth:`__call__` method; the effect is then the same as if that method was called.
ru: В классе должен быть определён метод «:meth:`__call__`» (одноимённый метод определённый в самом экземпляре – игнорируется при простом вызове экземпляра ) , в остальном – аналогично вызову *метода* экземпляра класса.

source: The power operator
ru: Оператор возведения в степень

source: The power operator binds more tightly than unary operators on its left; it binds less tightly than unary operators on its right. The syntax is:
ru: Оператор степени имеет бо́льший приоритет, чем однооперандные операторы непосредственно слева, но меньший, чем однооперандные операторы непосредственно справа. Его синтаксис :

source: Thus, in an unparenthesized sequence of power and unary operators, the operators are evaluated from right to left (this does not constrain the evaluation order for the operands): ``-1**2`` results in ``-1``.
ru: Таким образом в последовательности без кавычек из степени и однооперандных операторов вычисление выполняется с права налево (это не влияет на порядок действий вутри выражений операндов) : «``-1**2``» даёт результат «``-1``» .

source: The power operator has the same semantics as the built-in :func:`pow` function, when called with two arguments: it yields its left argument raised to the power of its right argument. The numeric arguments are first converted to a common type, and the result is of that type.
ru: Оператор степени имеет тот же смысл, что и встроенная функция «:func:`pow`» – если вызывается с двумя аргументами : левый аргумент возводится в степень правого. Числовые аргументы сначала преобразуются к общему типу, и результат будет этого же типа.

source: For int operands, the result has the same type as the operands unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``10**2`` returns ``100``, but ``10**-2`` returns ``0.01``.
ru: Для целочисленных операндов результат тоже будет целым, если только второй операнд не негативный – в таком случае все аргументы преобразуются в дробные, и результат тоже будет дробный. Например : «``10**2``» даёт «``100``» , но «``10**-2``» даёт «``0.01``» .

source: Raising ``0.0`` to a negative power results in a :exc:`ZeroDivisionError`. Raising a negative number to a fractional power results in a :class:`complex` number. (In earlier versions it raised a :exc:`ValueError`.)
ru: Возведение «``0.0``» в негативную степень вызывает исключение «:exc:`ZeroDivisionError`» . Возведение негативного числа в дробную степень даёт комплексное число (в прошлых версиях вызывалось исключение «:exc:`ValueError`» ) .

source: Unary arithmetic and bitwise operations
ru: Однооперандные арифметические и побитовые операци

source: All unary arithmetic and bitwise operations have the same priority:
ru: Все однооперандные арифметические и побитовые операци имеют одинаковый приоритет :

source: The unary ``-`` (minus) operator yields the negation of its numeric argument.
ru: «``-``» (минус) негативирует (умножает на «``-1``» ) свой числовой аргумент.

source: The unary ``+`` (plus) operator yields its numeric argument unchanged.
ru: «``+``» (плюс) не изменяет свой числовой аргумент.

source: The unary ``~`` (invert) operator yields the bitwise inversion of its integer argument. The bitwise inversion of ``x`` is defined as ``-(x+1)``. It only applies to integral numbers.
ru: Оператор «``~``» побитово инвертирует свой целочисленный аргумент, и для аргумента «``x``» определяется как «``-(x+1)``» .

source: In all three cases, if the argument does not have the proper type, a :exc:`TypeError` exception is raised.
ru: Во всех трёх случаях – если аргумент не требуемого типа, то вызывается исключение «:exc:`TypeError`» .

source: Binary arithmetic operations
ru: Двухоперандные арифметические операции

source: The binary arithmetic operations have the conventional priority levels. Note that some of these operations also apply to certain non-numeric types. Apart from the power operator, there are only two levels, one for multiplicative operators and one for additive operators:
ru: У двухоперандных арифметических операций уровни приоритета соответствуют общепринятым. Заметьте, что некоторые из них также применяются для нечисловых типов. Кроме операции степени – среди них есть только два уровня приоритета : выше – для произведения и деления (одинаковый) , и ниже – для суммы и вычитания (одинаковый) .

source: The ``*`` (multiplication) operator yields the product of its arguments. The arguments must either both be numbers, or one argument must be an integer and the other must be a sequence. In the former case, the numbers are converted to a common type and then multiplied together. In the latter case, sequence repetition is performed; a negative repetition factor yields an empty sequence.
ru: Оператор «``*``» (умножение) даёт произведение своих операндов. Операнды должны быть или оба чи́сла, или один – число, а другой последовательность. В первом случае – числа преобразуются к общему типу и перемножаются. Во втором – последовательность повторяется количество раз равное другому операнду, чьё отрицательное значение означает ноль повторений (пустая последовательность) .

source: The ``/`` (division) and ``//`` (floor division) operators yield the quotient of their arguments. The numeric arguments are first converted to a common type. Integer division yields a float, while floor division of integers results in an integer; the result is that of mathematical division with the 'floor' function applied to the result. Division by zero raises the :exc:`ZeroDivisionError` exception.
ru: Операторы «``/``» (деление) и «``//``» (деление нацело) дают частное своих операндов. Операнды должны быть оба числа и они преобразуются к общему типу. Деление даёт в результате дробное число. Деление нацело даёт в результате целое число, получающееся из соответствующего дробного результата округлением функцией «:func:`floor`» . Деление на ноль вызывает исключение «:exc:`ZeroDivisionError`» .

source: The ``%`` (modulo) operator yields the remainder from the division of the first argument by the second. The numeric arguments are first converted to a common type. A zero right argument raises the :exc:`ZeroDivisionError` exception. The arguments may be floating point numbers, e.g., ``3.14%0.7`` equals ``0.34`` (since ``3.14`` equals ``4*0.7 + 0.34``.) The modulo operator always yields a result with the same sign as its second operand (or zero); the absolute value of the result is strictly smaller than the absolute value of the second operand [#]_.
ru: Оператор «``%``» (остаток деления) даёт остаток деления первого операнда на второй. Операнды должны быть оба числами и они преобразуются к общему типу. При нолевом втором аргументе вызывается исключение «:exc:`ZeroDivisionError`» . Аргументы могут быть дробными числами, например, ``3.14%0.7`` равно ``0.34`` (поскольку ``3.14`` равно ``4*0.7 + 0.34`` ) . Результат всегда имеет знак, равный знаку делителя или же равен нолю. Модуль результата строго меньше модуля делителя. [#]_

source: The floor division and modulo operators are connected by the following identity: ``x == (x//y)*y + (x%y)``. Floor division and modulo are also connected with the built-in function :func:`divmod`: ``divmod(x, y) == (x//y, x%y)``. [#]_.
ru: Операторы деления нацело и остатка связаны следующим равенством : «``x == (x//y)*y + (x%y)``» . Также они связаны со встроенной функцией «:func:`divmod`» : «``divmod(x, y) == (x//y, x%y)``» . [#]_

source: In addition to performing the modulo operation on numbers, the ``%`` operator is also overloaded by string objects to perform old-style string formatting (also known as interpolation). The syntax for string formatting is described in the Python Library Reference, section :ref:`old-string-formatting`.
ru: В строковых объектах оператор «``%``» переопределён и используется для старого стиля форматирования текста (так называемые “interpolation” ) . Синтаксис такого форматирования определён в “Python Library Reference” раздел :ref:`old-string-formatting` .

source: The floor division operator, the modulo operator, and the :func:`divmod` function are not defined for complex numbers. Instead, convert to a floating point number using the :func:`abs` function if appropriate.
ru: Операторы деления нацело, взятие остатка и функция «:func:`divmod`» не определены для комплексных чисел – требуется явное преобразование в дробные функцией «:func:`abs`» .

source: The ``+`` (addition) operator yields the sum of its arguments. The arguments must either both be numbers or both sequences of the same type. In the former case, the numbers are converted to a common type and then added together. In the latter case, the sequences are concatenated.
ru: Оператор «``+``» (сложение) даёт сумму своих аргументов. Аргументы должны быть или оба числами, или оба последовательностями одинакового типа. В первом случае – числа преобразуются к общему типу и складываются. Во втором – последовательности соединяются .

source: The ``-`` (subtraction) operator yields the difference of its arguments. The numeric arguments are first converted to a common type.
ru: Оператор «``-``» (вычитание) даёт разность своих аргументов. Числовые аргументы сначала преобразуются к общему типу.

source: Shifting operations
ru: Операции сдвига

source: The shifting operations have lower priority than the arithmetic operations:
ru: Операции сдвига имеют приоритет меньший, чем у арифметических операций :

source: These operators accept integers as arguments. They shift the first argument to the left or right by the number of bits given by the second argument.
ru: Аргументы должны быть целыми числами. Затем производится сдвиг двоичного представления первого аргумента соответственно влево или вправо на количество бит равное второму аргументу.

source: A right shift by *n* bits is defined as division by ``pow(2,n)``. A left shift by *n* bits is defined as multiplication with ``pow(2,n)``.
ru: Сдвиг вправо определяется как целая часть от деления на 2 в степени второго аргумента («``a>>b``» = «``a / pow(2, b)``») . Сдвиг влево определяется как умножение на 2 в степени второго аргумента («``a<<b``» = «``a * pow(2, b)``») .

source: Binary bitwise operations
ru: Двоичные побитовые операции

source: Each of the three bitwise operations has a different priority level:
ru: Все эти три операции имеют разный приоритет :

source: The ``&`` operator yields the bitwise AND of its arguments, which must be integers.
ru: Оператор «``&``» производит побитовую операцию “И” (“AND”) над целочисленными аргументами.

source: The ``^`` operator yields the bitwise XOR (exclusive OR) of its arguments, which must be integers.
ru: Оператор «``^``» производит побитовую операцию “исключающее ИЛИ” (“XOR”) над целочисленными аргументами.

source: The ``|`` operator yields the bitwise (inclusive) OR of its arguments, which must be integers.
ru: Оператор «``|``» производит побитовую операцию “ИЛИ” (“OR”) над целочисленными аргументами.

source: Comparisons
ru: Сравнения

source: Unlike C, all comparison operations in Python have the same priority, which is lower than that of any arithmetic, shifting or bitwise operation. Also unlike C, expressions like ``a < b < c`` have the interpretation that is conventional in mathematics:
ru: В отличие от “C” – все операции сравнения в Питоне имеют одинаковый приоритет, который ниже, чем у любых арифметических, сдвиговых или побитовых операций. Также, в отличие от “C” , выражения типа «``a < b < c``» интерпретируются, как это принято в математике.

source: Comparisons yield boolean values: ``True`` or ``False``.
ru: Сравнения дают в результате булевы значения : «:const:`True`» или «:const:`False`» .

source: Comparisons can be chained arbitrarily, e.g., ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that ``y`` is evaluated only once (but in both cases ``z`` is not evaluated at all when ``x < y`` is found to be false).
ru: Сравнения могут соединяться в произвольные цепочки, например : «``x < y <= z``» эквивалентно «``x < y and y <= z``» , за исключением того, что «``y``» вычисляется только один раз (но в обоих вариантах «``z``» вообще не вычисляется, если «``x < y``» не верно) .

source: Formally, if *a*, *b*, *c*, ..., *y*, *z* are expressions and *op1*, *op2*, ..., *opN* are comparison operators, then ``a op1 b op2 c ... y opN z`` is equivalent to ``a op1 b and b op2 c and ... y opN z``, except that each expression is evaluated at most once.
ru: Общее правило : если *a*, *b*, *c*, ..., *y*, *z* – выражения, и *op1*, *op2*, ..., *opN* – операторы сравнения, то «``a op1 b op2 c ... y opN z``» является эквивалентом «``a op1 b and b op2 c and ... y opN z``» , за исключением того, что каждое выражение вычисляется только один раз.

source: Note that ``a op1 b op2 c`` doesn't imply any kind of comparison between *a* and *c*, so that, e.g., ``x < y > z`` is perfectly legal (though perhaps not pretty).
ru: Заметьте, что «``a op1 b op2 c``» не подразумевает никаких сравнений «``a``» и «``c``» , так что, например, «``x < y > z``» абсолютно приемлемо (хотя и не очень красиво) .

source: The operators ``<``, ``>``, ``==``, ``>=``, ``<=``, and ``!=`` compare the values of two objects. The objects need not have the same type. If both are numbers, they are converted to a common type. Otherwise, the ``==`` and ``!=`` operators *always* consider objects of different types to be unequal, while the ``<``, ``>``, ``>=`` and ``<=`` operators raise a :exc:`TypeError` when comparing objects of different types that do not implement these operators for the given pair of types. You can control comparison behavior of objects of non-built-in types by defining rich comparison methods like :meth:`__gt__`, described in section :ref:`customization`.
ru: Операторы «``<``» , «``>``» , «``==``» , «``>=``» , «``<=``» и «``!=``» сравнивают значения двух объектов. Эти объекты не обязаны иметь одинаковый тип. Если оба являются числами, то они преобразуются к общему типу. Если не числа, то операторы «``==``» и «``!=``» всегда считают объекты отличающихся типов неравными, а операторы «``<``» , «``>``» , «``>=``» и «``<=``» вызывают «:exc:`TypeError`» для отличающихся типов, не имеющих реализации соответствующих операторов для данной пары типов. Вы можете контролировать поведение сравнения для объектов не встроенных типов, определяя методы расширенного сравнения типа «:meth:`__gt__`» , как описано в разделе “Основные средства настройки классов” :ref:`customization` .

source: Comparison of objects of the same type depends on the type:
ru: Сравнение объектов одинакового типа зависит от типа :

source: Numbers are compared arithmetically.
ru: Числа сравниваются арифметически.

source: The values :const:`float('NaN')` and :const:`Decimal('NaN')` are special. The are identical to themselves, ``x is x`` but are not equal to themselves, ``x != x``. Additionally, comparing any value to a not-a-number value will return ``False``. For example, both ``3 < float('NaN')`` and ``float('NaN') < 3`` will return ``False``.
ru: Значения «:const:`float('NaN')`» и «:const:`Decimal('NaN')`» являются особыми. Они идентичны самим себе «``x is x``» , но не равны самим себе «``x != x``» . Более того, сравнение любого значения с “Not-a-Number” возвращает «:const:`False`» . Например : и «``3 < float('NaN')``» и «``float('NaN') < 3``» вернут «:const:`False`» .

source: Bytes objects are compared lexicographically using the numeric values of their elements.
ru: «:term:`“Байты”<bytes>`» сравниваются поэлементно до первого несовпадения (лексикографически) , с использованием числовых значений их элементов.

source: Strings are compared lexicographically using the numeric equivalents (the result of the built-in function :func:`ord`) of their characters. [#]_ String and bytes object can't be compared!
ru: “Строки” сравниваются посимвольно до первого несовпадения (лексикографически) , с использованием числовых эквивалентов (возвращаемых встроенной функцией «:func:`ord`» ) для их элементов-симвлов. [#]_ “Строки” нельзя сравнивать с байтами.

source: Tuples and lists are compared lexicographically using comparison of corresponding elements. This means that to compare equal, each element must compare equal and the two sequences must be of the same type and have the same length.
ru: Кортежи и списки сравниваются поэлементно до первого несовпадения (лексикографически) . Это подразумевает, что для равенства – все соответствующие элементы должны быть равны и сами последовательности должны быть одинакового типа и одинаковой длины.
